UCB_CS61_lec38.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十八课: Randomized Analysis
#+PROPERTY: header-args:ipython :session 第三十八课: Randomized Analysis
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十八课: Randomized Analysis
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


- Randomized analysis， 要求的是广度;
- Amortized analysis， 要求的是深度;

_*广度的意思是说*_ , 我希望样本的分布更 *均匀* ，像 quicksort(pivot)，
hashtable(hashcode), 有依赖 *随机* 的属性. 这个属性会影响算法结果, _*深度的意思
是说*_ ，我的结果依赖于我之前执行的次数，执行的越多越好，有点像 *循环进化* 的意
思，比如 disjoint set(path compression), splaytree


* Principle of randomized analysis
randomized analysis is also proving the average running time of an algorithm.

quickSort 最差复杂度是 O(n^2),但是如果你运行 quickSort again and agian and again...
it will get the average running time O(nlogn),which is the best result in
comparison-based(2-way desicion) algorithms.

需要注意的是，这里的原理跟以 hashtable,splayTree,disjointSet 为代表的演进派数据
结构（amortized analysis）不同这里不是因为一直优化一直 balance the tree 而获得的
时间复杂度的减少，而是通过一直投硬币一直投硬币...来获得一个稳定的概率分布。
* what is a randomized algorithms
_Randomized_algorithms_ are algorithms that make decisions based on rolls of the
dice. The random numbers actually help to keep the running time low. Examples
are quicksort, quickselect, and hash tables with random hash codes.

Randomized analysis, like amortized analysis, is a mathematically rigorous way
of saying, "The average running time of this operation is fast, even though the
worst-case running time is slow." Unlike amortized analysis, the "average" is
taken over an infinite number of runs of the program. A randomized algorithm
will sometimes run more slowly than the average, but the probability that it
will run _asymptotically_ slower is extremely low.

Randomized analysis requires a little bit of probability theory.

* Expectation
Expectation 实际就是一种 average，一种概率分布下的平均。

** Use x() simulate, running one kind of api()

Suppose a method x() flips a coin. If the coin comes up heads, x() takes one
second to execute. If it comes up tails, x() takes three seconds.

Let X be the exact running time of one call to x(). With probability 0.5, X is
1, and with probability 0.5, X is 3. For obvious reasons, X is called a
_random_variable_.

The _expected_ value of X is the average value X assumes in an infinite sequence
of coin flips,

#+BEGIN_EXAMPLE
  E[X] = 0.5 * 1 + 0.5 * 3 = 2 seconds expected time.
#+END_EXAMPLE

** Use x() x() simulate, running two kinds of api()
Suppose we run the code sequence

#+BEGIN_SRC java
  x();     // takes time X
  x();     // takes time Y
#+END_SRC

and let Y be the running time of the _second_ call. The total running time is T
= X + Y. (Y and T are also random variables.) What is the expected total running
time E[T]?

The main idea from probability we need is called _linearity_of_expectation_,
which says that expected running times sum linearly.

#+BEGIN_EXAMPLE
  E[x()] = E[X + Y]
  E[X + Y] = E[X] + E[Y]
           = 2 + 2
           = 4 seconds expected time.
#+END_EXAMPLE

The interesting thing is that linearity of expectation holds true whether or not
X and Y are _independent_. Independence means that the first coin flip has no
effect on the outcome of the second. If X and Y are independent, the code will
take four seconds on average. But what if they're not? Suppose the second coin
flip always matches the first--we always get two heads, or two tails. Then the
code still takes four seconds on average. If the second coin flip is always the
opposite of the first--we always get one head and one tail-- the code still
takes four seconds on average.

** when get each api()'s EXPECTATION, we get total program's EXPECTATION
*So if we determine the expected running time of each individual operation, we*
*can determine the expected running time of a whole program by adding up the*
*expected costs of all the operations.*
