UCB_CS61_lec38.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 19:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十八课: Randomized Analysis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十八课: Randomized Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org36b3183">lec 38 Randomized analysis</a>
<ul>
<li><a href="#orgd0e8a0d">Principle of randomized analysis</a></li>
<li><a href="#orgcf614b6">what is a randomized algorithms</a></li>
<li><a href="#orgdf06fb3">Expectation</a>
<ul>
<li><a href="#org349af98">Use x() simulate, running one kind of api()</a></li>
<li><a href="#org6948cea">Use x() x() simulate, running two kinds of api()</a></li>
<li><a href="#org5c3fe82">when get each api()'s EXPECTATION, we get total program's EXPECTATION</a></li>
</ul>
</li>
<li><a href="#org2e0c6a6">use Randomized analysis in HashTables</a>
<ul>
<li><a href="#org7a8c00b">assuming using chaining and no duplicate keys</a></li>
<li><a href="#org7e7c918">analyze find(), n 个弹珠（keys）放在 N 个袋子（buckets）中</a></li>
<li><a href="#org3763e38">Load factor occurs</a></li>
<li><a href="#orgcacceea">Summarized</a></li>
</ul>
</li>
<li><a href="#orgf29e668">use Randomized analysis in Quicksort</a>
<ul>
<li><a href="#org86c349a">Summarized</a></li>
</ul>
</li>
<li><a href="#org4ec53bb">use Randomized analysis in Quickselect</a></li>
<li><a href="#org8b70e45">Amortized Time vs. Expected Time</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org36b3183" class="outline-2">
<h2 id="org36b3183">lec 38 Randomized analysis</h2>
<div class="outline-text-2" id="text-org36b3183">
<ul class="org-ul">
<li>Randomized analysis， 要求的是广度;</li>
<li>Amortized analysis， 要求的是深度;</li>
</ul>

<p>
<span class="underline"><b>广度的意思是说</b></span> , 我希望样本的分布更 <b>均匀</b> ，像 quicksort(pivot)，
hashtable(hashcode), 有依赖 <b>随机</b> 的属性. 这个属性会影响算法结果, <span class="underline"><b>深度的意思是说</b></span> ，我的结果依赖于我之前执行的次数，执行的越多越好，有点像 <b>循环进化</b> 的意思，比如 disjoint set(path compression), splaytree
</p>
</div>


<div id="orgd0e8a0d" class="outline-3">
<h3 id="orgd0e8a0d">Principle of randomized analysis</h3>
<div class="outline-text-3" id="text-orgd0e8a0d">
<p>
randomized analysis is also proving the average running time of an algorithm.
</p>

<p>
quickSort 最差复杂度是 O(n^2),但是如果你运行 quickSort again and agian and again&#x2026;
it will get the average running time O(nlogn),which is the best result in
comparison-based(2-way desicion) algorithms.
</p>

<p>
需要注意的是，这里的原理跟以 hashtable,splayTree,disjointSet 为代表的演进派数据结构（amortized analysis）不同这里不是因为一直优化一直 balance the tree 而获得的时间复杂度的减少，而是通过一直投硬币一直投硬币&#x2026;来获得一个稳定的概率分布。
</p>
</div>
</div>
<div id="orgcf614b6" class="outline-3">
<h3 id="orgcf614b6">what is a randomized algorithms</h3>
<div class="outline-text-3" id="text-orgcf614b6">
<p>
<span class="underline">Randomized_algorithms</span> are algorithms that make decisions based on rolls of the
dice. The random numbers actually help to keep the running time low. Examples
are quicksort, quickselect, and hash tables with random hash codes.
</p>

<p>
Randomized analysis, like amortized analysis, is a mathematically rigorous way
of saying, "The average running time of this operation is fast, even though the
worst-case running time is slow." Unlike amortized analysis, the "average" is
taken over an infinite number of runs of the program. A randomized algorithm
will sometimes run more slowly than the average, but the probability that it
will run <span class="underline">asymptotically</span> slower is extremely low.
</p>

<p>
Randomized analysis requires a little bit of probability theory.
</p>
</div>
</div>

<div id="orgdf06fb3" class="outline-3">
<h3 id="orgdf06fb3">Expectation</h3>
<div class="outline-text-3" id="text-orgdf06fb3">
<p>
Expectation 实际就是一种 average，一种概率分布下的平均。
</p>
</div>

<div id="org349af98" class="outline-4">
<h4 id="org349af98">Use x() simulate, running one kind of api()</h4>
<div class="outline-text-4" id="text-org349af98">
<p>
Suppose a method x() flips a coin. If the coin comes up heads, x() takes one
second to execute. If it comes up tails, x() takes three seconds.
</p>

<p>
Let X be the exact running time of one call to x(). With probability 0.5, X is
1, and with probability 0.5, X is 3. For obvious reasons, X is called a
<span class="underline">random_variable</span>.
</p>

<p>
The <span class="underline">expected</span> value of X is the average value X assumes in an infinite sequence
of coin flips,
</p>

<pre class="example">
E[X] = 0.5 * 1 + 0.5 * 3 = 2 seconds expected time.
</pre>
</div>
</div>

<div id="org6948cea" class="outline-4">
<h4 id="org6948cea">Use x() x() simulate, running two kinds of api()</h4>
<div class="outline-text-4" id="text-org6948cea">
<p>
Suppose we run the code sequence
</p>

<div class="org-src-container">
<pre class="src src-java">x();     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">takes time X</span>
x();     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">takes time Y</span>
</pre>
</div>

<p>
and let Y be the running time of the <span class="underline">second</span> call. The total running time is T
= X + Y. (Y and T are also random variables.) What is the expected total running
time E[T]?
</p>

<p>
The main idea from probability we need is called <span class="underline">linearity_of_expectation</span>,
which says that expected running times sum linearly.
</p>

<pre class="example">
E[x()] = E[X + Y]
E[X + Y] = E[X] + E[Y]
         = 2 + 2
         = 4 seconds expected time.
</pre>

<p>
The interesting thing is that linearity of expectation holds true whether or not
X and Y are <span class="underline">independent</span>. Independence means that the first coin flip has no
effect on the outcome of the second. If X and Y are independent, the code will
take four seconds on average. But what if they're not? Suppose the second coin
flip always matches the first&#x2013;we always get two heads, or two tails. Then the
code still takes four seconds on average. If the second coin flip is always the
opposite of the first&#x2013;we always get one head and one tail&#x2013; the code still
takes four seconds on average.
</p>
</div>
</div>

<div id="org5c3fe82" class="outline-4">
<h4 id="org5c3fe82">when get each api()'s EXPECTATION, we get total program's EXPECTATION</h4>
<div class="outline-text-4" id="text-org5c3fe82">
<p>
<b>So if we determine the expected running time of each individual operation, we</b>
<b>can determine the expected running time of a whole program by adding up the</b>
<b>expected costs of all the operations.</b>
</p>
</div>
</div>
</div>
