UCB_CS61_lec38.org
* use Randomized analysis in HashTables
#+BEGIN_EXAMPLE
    用在 hashtable，处理的核心估计问题是：
      处理 collision，当一个 bucket 中存有多个 item 时
      hashtable 的 api()的 average running time.
    用到的基本模型是：
      n 个弹珠（key）放进 N 个袋子（bucket）中，平均起来看（Expectation）
      会有多少个弹珠出现在袋子 b 中
#+END_EXAMPLE

#+BEGIN_QUOTE
 when i say a randomly chosen bucket, I do not mean that every time we hash a
 key we roll a dice,no no no Nooooooooo! _you ONLY roll the dice once per key._

 Because for a hash table to work, _the same key has to hash to the same bucket_
 _every time_.

 So, yes, every key has a randomly chosen bucket, but _one that bucket has
 chosen_ _it stays that way forever._
#+END_QUOTE

 The implementations of hash tables we have studied don't use random numbers,
 but we can model the effects of collisions on running time by pretending we
 have a random hash code.

 A _random_hash_code_ maps each possible key to a number that's chosen randomly.
 This does _not_ mean we roll dice every time we hash a key.  A hash table can
 only work if a key maps to the same bucket every time.  Each key hashes to a
 randomly chosen bucket in the table, but a key's random hash code never
 changes.

 Unfortunately, it's hard to choose a hash code randomly from all possible hash
 codes, because you need to remember a random number for each key, and that
 would seem to require another hash table.  However, random hash codes are
 a good _model_ for how a good hash code will perform.  The model isn't perfect,
 and it doesn't apply to bad hash codes, but for a hash code that proves
 effective in experiments, it's a good rough guess.  Moreover, there is a sneaky
 number-theoretical trick called _universal_hashing_ that generates random hash
 codes.  These random hash codes are chosen from a relatively small set of
 possibilities, yet they perform just as well as if they were chosen from the
 set of all possible hash codes.  (If you're interested, you can read about it
 in the textbook "Algorithms" by Cormen, Leiserson, Rivest, and Stein.)
** assuming using chaining and no duplicate keys
Assume our hash table uses chaining and does not allow duplicate keys. If an
entry is inserted whose key matches an existing entry, the old entry is
replaced.
** analyze find(), n 个弹珠（keys）放在 N 个袋子（buckets）中
Suppose we perform the operation find(k), and the key k hashes to a bucket b.
Bucket b contains at most one entry with key k, so the cost of the search is one
dollar, plus an additional dollar for every entry stored in bucket b whose key
is not k. (Recall from last lecture that a _dollar_ is a unit of time chosen
large enough to make this statement true.)

Suppose there are n keys in the table besides k.  Let V1, V2, ..., Vn be random
variables such that for each key ki, the variable

#+BEGIN_EXAMPLE
     / 1,  if key ki hashes to bucket b
Vi = |
     \ 0,  else
#+END_EXAMPLE

Then the cost of _find(k)_ is

#+BEGIN_EXAMPLE
  T = 1 + V1 + V2 + ... + Vn.
#+END_EXAMPLE

The expected cost of find(k) is (by linearity of expectation)

#+BEGIN_EXAMPLE
  E[T] = 1 + E[V1] + E[V2] + ... + E[Vn].
#+END_EXAMPLE

What is E[Vi]?  Since there are N buckets, and the hash code is random, each
key has a 1/N probability of hashing to bucket b.

#+BEGIN_EXAMPLE
  E[Vi] = 1/N

  E[T] = 1 + n/N,
#+END_EXAMPLE

到这里，看到一些概率论里的影子了，其实这里就是 n 个 key，往 N 个桶里随即分配的问题。只不过加了
一些限制，比如 n 不能超过 N 太多（collision 太多），比如 N 不能超 n 太多（内存空间浪费太多）。
对于每一个 key 来说，从 N 个桶中选一个，都是 1/N 的概率。

** Load factor occurs

    #+BEGIN_EXAMPLE
     E[find()] = 1 + n/N
               = 1 + LoadFactor
    #+END_EXAMPLE

which is one plus the load factor! If we keep the load factor n/N below some
constant c as n grows, find operations cost expected O(1) time.

The same analysis applies to insert and remove operations.  All three hash
table operations take O(1) expected amortized time.  (The word "amortized"
accounts for table resizing, as discussed last lecture.)

Observe that the running times of hash table operations are _not_ independent.
If key k1 and key k2 both hash to the same bucket, it increases the running time
of both find(k1) and find(k2). Linearity of expectation is important because it
implies that we can add the expected costs of individual operations, and obtain
the expected total cost of all the operations an algorithm performs.
** Summarized

    - Hash table ops take O(1) expected  time,if not resized.
    - Hahs talbe ops take O(1) amortized time,if resized.
