UCB_CS61_lec38.html
<div id="org2e0c6a6" class="outline-3">
<h3 id="org2e0c6a6">use Randomized analysis in HashTables</h3>
<div class="outline-text-3" id="text-org2e0c6a6">
<pre class="example">
    用在 hashtable，处理的核心估计问题是：
      处理 collision，当一个 bucket 中存有多个 item 时
      hashtable 的 api()的 average running time.
    用到的基本模型是：
      n 个弹珠（key）放进 N 个袋子（bucket）中，平均起来看（Expectation）
      会有多少个弹珠出现在袋子 b 中
</pre>

<blockquote>
<p>
when i say a randomly chosen bucket, I do not mean that every time we hash a
key we roll a dice,no no no Nooooooooo! <span class="underline">you ONLY roll the dice once per key.</span>
</p>

<p>
Because for a hash table to work, <span class="underline">the same key has to hash to the same bucket</span>
<span class="underline">every time</span>.
</p>

<p>
So, yes, every key has a randomly chosen bucket, but <span class="underline">one that bucket has
chosen</span> <span class="underline">it stays that way forever.</span>
</p>
</blockquote>

<p>
The implementations of hash tables we have studied don't use random numbers,
but we can model the effects of collisions on running time by pretending we
have a random hash code.
</p>

<p>
A <span class="underline">random_hash_code</span> maps each possible key to a number that's chosen randomly.
This does <span class="underline">not</span> mean we roll dice every time we hash a key.  A hash table can
only work if a key maps to the same bucket every time.  Each key hashes to a
randomly chosen bucket in the table, but a key's random hash code never
changes.
</p>

<p>
Unfortunately, it's hard to choose a hash code randomly from all possible hash
codes, because you need to remember a random number for each key, and that
would seem to require another hash table.  However, random hash codes are
a good <span class="underline">model</span> for how a good hash code will perform.  The model isn't perfect,
and it doesn't apply to bad hash codes, but for a hash code that proves
effective in experiments, it's a good rough guess.  Moreover, there is a sneaky
number-theoretical trick called <span class="underline">universal_hashing</span> that generates random hash
codes.  These random hash codes are chosen from a relatively small set of
possibilities, yet they perform just as well as if they were chosen from the
set of all possible hash codes.  (If you're interested, you can read about it
in the textbook "Algorithms" by Cormen, Leiserson, Rivest, and Stein.)
</p>
</div>
<div id="org7a8c00b" class="outline-4">
<h4 id="org7a8c00b">assuming using chaining and no duplicate keys</h4>
<div class="outline-text-4" id="text-org7a8c00b">
<p>
Assume our hash table uses chaining and does not allow duplicate keys. If an
entry is inserted whose key matches an existing entry, the old entry is
replaced.
</p>
</div>
</div>
<div id="org7e7c918" class="outline-4">
<h4 id="org7e7c918">analyze find(), n 个弹珠（keys）放在 N 个袋子（buckets）中</h4>
<div class="outline-text-4" id="text-org7e7c918">
<p>
Suppose we perform the operation find(k), and the key k hashes to a bucket b.
Bucket b contains at most one entry with key k, so the cost of the search is one
dollar, plus an additional dollar for every entry stored in bucket b whose key
is not k. (Recall from last lecture that a <span class="underline">dollar</span> is a unit of time chosen
large enough to make this statement true.)
</p>

<p>
Suppose there are n keys in the table besides k.  Let V1, V2, &#x2026;, Vn be random
variables such that for each key ki, the variable
</p>

<pre class="example">
     / 1,  if key ki hashes to bucket b
Vi = |
     \ 0,  else
</pre>

<p>
Then the cost of <span class="underline">find(k)</span> is
</p>

<pre class="example">
T = 1 + V1 + V2 + ... + Vn.
</pre>

<p>
The expected cost of find(k) is (by linearity of expectation)
</p>

<pre class="example">
E[T] = 1 + E[V1] + E[V2] + ... + E[Vn].
</pre>

<p>
What is E[Vi]?  Since there are N buckets, and the hash code is random, each
key has a 1/N probability of hashing to bucket b.
</p>

<pre class="example">
E[Vi] = 1/N

E[T] = 1 + n/N,
</pre>

<p>
到这里，看到一些概率论里的影子了，其实这里就是 n 个 key，往 N 个桶里随即分配的问题。只不过加了一些限制，比如 n 不能超过 N 太多（collision 太多），比如 N 不能超 n 太多（内存空间浪费太多）。对于每一个 key 来说，从 N 个桶中选一个，都是 1/N 的概率。
</p>
</div>
</div>

<div id="org3763e38" class="outline-4">
<h4 id="org3763e38">Load factor occurs</h4>
<div class="outline-text-4" id="text-org3763e38">
<pre class="example">
E[find()] = 1 + n/N
          = 1 + LoadFactor
</pre>

<p>
which is one plus the load factor! If we keep the load factor n/N below some
constant c as n grows, find operations cost expected O(1) time.
</p>

<p>
The same analysis applies to insert and remove operations.  All three hash
table operations take O(1) expected amortized time.  (The word "amortized"
accounts for table resizing, as discussed last lecture.)
</p>

<p>
Observe that the running times of hash table operations are <span class="underline">not</span> independent.
If key k1 and key k2 both hash to the same bucket, it increases the running time
of both find(k1) and find(k2). Linearity of expectation is important because it
implies that we can add the expected costs of individual operations, and obtain
the expected total cost of all the operations an algorithm performs.
</p>
</div>
</div>
<div id="orgcacceea" class="outline-4">
<h4 id="orgcacceea">Summarized</h4>
<div class="outline-text-4" id="text-orgcacceea">
<ul class="org-ul">
<li>Hash table ops take O(1) expected  time,if not resized.</li>
<li>Hahs talbe ops take O(1) amortized time,if resized.</li>
</ul>
</div>
</div>
</div>
