UCB_CS61_lec38.html
<div id="orgf29e668" class="outline-3">
<h3 id="orgf29e668">use Randomized analysis in Quicksort</h3>
<div class="outline-text-3" id="text-orgf29e668">
<p>
[TODO]
</p>
<pre class="example">
    用在 hashtable，处理的核心估计问题是：
      处理 collision，当一个 bucket 中存有多个 item 时
      hashtable 的 api()的 average running time.
    用到的基本模型是：
      n 个弹珠（key）放进 N 个袋子（bucket）中，平均起来看（Expectation）
      会有多少个弹珠出现在袋子 b 中
</pre>

<pre class="example">
                   MergeSort                       QuickSort
         / +--------------------------+      +----------------------------+
        |  |                          |      |                            |
        |  +-------/----------\-------+      +----/--------------\--------+
        |  +-----------+  +-----------+      +-------+  +-----------------+
O(logn) &lt;  |           |  |           |      |       |  |                 |
        |  +-/------\--+  +--/-----\--+      +-/---\-+  +-----/--------\--+
        |  +----+ +----+  +----+ +----+      +--+ +--+  +----------+ +----+
        |  |    | |    |  |    | |    |      |  | |  |  |          | |    |
         \ +----+ +----+  +----+ +----+      +--+ +--+  +---/----\-+ +----+
                                                        +------+ +-+
            \------------------------/                  |      | | |    (ref:level deeper, sort less, cost less)
                        v                               +-/--\-+ +-+
                       O(n)                             +-+ +--+
                                                        | | |  |
                                                        +-+ +--+

</pre>

<ul class="org-ul">
<li>mergeSort 和 quickSort 看起来一样，其实大相径庭，简直就是相反的：</li>
<li>mergeSort 重合不重分，合完了排序才算完; 时间主要用在合上; 每一层都需要合并 n 个数值，合并每层都耗时相似 O(n)</li>
<li>quickSort 重分不重合，分完了排序就完了; 时间主要用在分上; <a href="#coderef-level deeper, sort less, cost less" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-level deeper, sort less, cost less');" onmouseout="CodeHighlightOff(this, 'coderef-level deeper, sort less, cost less');">越往深层走，这层需要排序(分割)的数列越少，这层的耗时越少</a></li>
</ul>

<p>
Recall that mergesort sorts n items in O(n log n) time because the recursion
tree has <code>1 + ceiling(log_2 n)</code> levels, and each level involves O(n) time spent
merging lists.
</p>

<p>
Quicksort also spends linear time at each level (partitioning the lists), but it
is trickier to analyze because the recursion tree is not perfectly balanced, and
<span class="underline">some keys survive to deeper levels than others.</span>
</p>

<p>
To analyze quicksort, let's analyze the EXPECTED depth the input key k will
reach in the tree. (In effect, we're measuring a <span class="underline">vertical slice</span> of the
recursion tree instead of a horizontal slice.) Assume no two keys are equal,
since that is the slowest case.
</p>


<p>
这里的意思是说，我没法向分析 mergeSort 那样按水平切片去分析，取而代之我使用竖直切片去分析 quickSort我去看每一个元素的会存活(未排序定)的深度(时间复杂度随深度降低)的 Expected 值，然后把他们加起来求整体 Expected 值。
</p>

<p>
Quicksort chooses a random pivot. The pivot is equally likely to be the smallest
key, the second smallest, the third smallest, &#x2026;, or the largest. For each
case, the probability is 1/n. Since we want a roughly balanced partition, let's
say that the least floor(n/4) keys(排定数列中位置最前的 1/4) and the greatest
floor(n/4) keys(排定数列中位置最靠后的 1/4) are "bad" pivots, and the other keys
are "good" pivots. Since there are at most n/2 bad pivots, the probability of
choosing a bad pivot is &lt;= 0.5.
</p>


<p>
这个意思是说 pivot 的选择，<a id="org76e4602"></a>，如果选择的 pivot 很好，正好处在排序完成后的中间位置，那么 key k 有可能处在 1/4-3/4其中一个 partition 中，这两个
partition 的问题空间都比原来的要小不少，good;但是如果选择差的 pivot，而且他正好处在排序完成后的末尾 or 开头位置，那么 key k 有可能处在 0 - 1中的 1 位置，也就是说，整个问题空间完全没改变。这样他更容易 survivor in deep level.耗时也就更多。
</p>

<p>
If we choose a good pivot, we'll have a 1/4-3/4 split or better, and our chosen
key k will go into a subset containing at most three quarters of the keys, which
is sorted recursively. If we choose a bad pivot, k might go into a subset with
nearly all the other keys.
</p>

<p>
Let D(n) be a random variable equal to the <span class="underline">deepest depth</span> at which key k
appears when we sort n keys. D(n) varies from run to run, but we can reason
about its expected value. Since we choose a bad key no more than half the time,
</p>

<p>
由于 D(n) 是 deepest depth, <a href="#org76e4602">No description for this link</a> 每一种都选最差的：
</p>

<ul class="org-ul">
<li>1/4 - 3/4 选 key k 在 3/4 中;</li>
<li><p>
0  -  1  选 key k 在 1 中;
</p>

<pre class="example">
E[D(n)] &lt;= 1 + 0.5 E[D(n)] + 0.5 E[D(3n / 4)].
</pre></li>
</ul>

<p>
Multiplying by two and subtracting E[D(n)] from both sides gives
</p>

<pre class="example">
E[D(n)] &lt;= 2 + E[D(3n / 4)].
</pre>

<p>
This inequality is called a <span class="underline">recurrence</span>, and you'll learn how to solve them in
CS 170. (No, recurrences won't be on the CS 61B final exam.) The base cases for
this recurrence are D(0) = 0 and D(1) = 0. It's easy to check by substitution
that a solution is
</p>

<pre class="example">
E[D(n)] &lt;= 2 log    n.
                4/3
</pre>
</div>

<div id="org86c349a" class="outline-4">
<h4 id="org86c349a">Summarized</h4>
<div class="outline-text-4" id="text-org86c349a">
<p>
So any arbitrary key k appears in expected O(log n) levels of the recursion
tree, and causes O(log n) partitioning work. By linearity of expectation, we can
sum the expected O(log n) work for each of the n keys, and we find that
quicksort runs in expected O(n log n) time.
</p>
</div>
</div>
</div>

<div id="org4ec53bb" class="outline-3">
<h3 id="org4ec53bb">use Randomized analysis in Quickselect</h3>
<div class="outline-text-3" id="text-org4ec53bb">
<p>
For quickselect, we can analyze the expected running time more directly.
Suppose we run quickselect on n keys.  Let P(n) be a random variable equal to
the total number of keys partitioned, summed over all the partitioning steps.
Then the running time is in Theta(P(n)).
</p>

<p>
Quickselect is like quicksort, but when we choose a good pivot, at least one
quarter of the keys are discarded.  We choose a good pivot at least half the
time, so
</p>

<pre class="example">
E[P(n)] &lt;= n + 0.5 E[P(n)] + 0.5 E[P(3n / 4)],
</pre>

<p>
which is solved by <code>E[P(n)] &lt;= 8n</code>. Therefore, the expected running time of
quickselect on n keys is in O(n).
</p>
</div>
</div>
