UCB_CS61_lec38.org
* Amortized Time vs. Expected Time
There's a subtle but important difference between amortized running time and
expected running time.

Quicksort with random pivots takes O(n log n) expected running time, but its
worst-case running time is in Theta(n^2).  This means that there is a small
possibility that quicksort will cost Omega(n^2) dollars, but the probability
of that happening approaches zero as n approaches infinity.

A splay tree operation takes O(log n) amortized time, but the worst-case
running time for a splay tree operation is in Theta(n).  Splay trees are not
randomized, and the "probability" of an Omega(n)-time splay tree operation is
not a meaningful concept.  If you take an empty splay tree, insert the items
1...n in order, then run find(1), the find operation _will_ cost n dollars.
But a sequence of n splay tree operations, starting from an empty tree, _never_
costs more than O(n log n) actual running time.  Ever.

Hash tables are an interesting case, because they use both amortization and
randomization.  Resizing takes Theta(n) time.  With a random hash code, there
is a tiny probability that every item will hash to the same bucket, so the
worst-case running time of an operation is Theta(n)--even without resizing.

To account for resizing, we use amortized analysis.  To account for collisions,
we use randomized analysis.  So when we say that hash table operations run in
O(1) time, we mean they run in O(1) _expected_, _amortized_ time.

| Splay trees                | O(log n) amortized time / operation         | ${*    }$ |
| Disjoint sets (tree-based) | O(alpha(f + u, u)) amortized time / find op | ${**   }$ |
| Quicksort                  | O(n log n) expected time                    | ${***  }$ |
| Quickselect                | Theta(n) expected time                      | ${**** }$ |
| Hash tables                | Theta(1) expected amortized time / op       | ${*****}$ |

If you take CS 170, you will learn an amortized analysis of disjoint sets
there.  Unfortunately, the analyses of both disjoint sets and splay trees are
complicated.  Goodrich & Tamassia give the amortized analysis of splay trees,
but you're not required to read or understand it for this class.

|---------+--------------------------------------------------------------------------|
| $*$     | Worst-case time is in Theta(n), worst-case amortized time is in          |
|         | Theta(log n), best-case time is in Theta(1).                             |
|---------+--------------------------------------------------------------------------|
| $**$    | For find operations, worst-case time is in Theta(log u), worst-case      |
|         | amortized time is in Theta(alpha(f + u, u)), best-case time is in        |
|         | Theta(1).  All union operations take Theta(1) time.                      |
|---------+--------------------------------------------------------------------------|
| $***$   | Worst-case time is in Theta(n^2)--if we get worst-case input AND         |
|         | worst-case random numbers.  "Worst-case expected" time is in             |
|         | Theta(n log n)--meaning when the _input_ is worst-case, but we take the  |
|         | average over all possible sequences of random numbers.  Recall that      |
|         | quicksort can be implemented so that keys equal to the pivot go into a   |
|         | separate list, in which case the best-case time is in Theta(n), because  |
|         | the best-case input is one where all the keys are equal.  If quicksort   |
|         | is implemented so that keys equal to the pivot are divided between lists |
|         | I1 and I2, as is the norm for array-based quicksort, then the best-case  |
|         | time is in Theta(n log n).                                               |
|---------+--------------------------------------------------------------------------|
| $****$  | Worst-case time is in Theta(n^2)--if we get worst-case input AND worst-  |
|         | case random numbers.  Worst-case expected time, best-case time, and      |
|         | best-case expected time are in Theta(n).                                 |
|---------+--------------------------------------------------------------------------|
| $*****$ | Worst-case time is in Theta(n), expected worst-case time is in Theta(n)  |
|         | (worst case is when table is resized), amortized worst-case time is in   |
|         | Theta(n) (worst case is when every item is in one bucket), worst-case    |
|         | expected amortized time is in Theta(1), best-case time is in Theta(1).   |
|         | Confused yet?                                                            |
|---------+--------------------------------------------------------------------------|
