UCB_CS61_lec38.html

<div id="org8b70e45" class="outline-3">
<h3 id="org8b70e45">Amortized Time vs. Expected Time</h3>
<div class="outline-text-3" id="text-org8b70e45">
<p>
There's a subtle but important difference between amortized running time and
expected running time.
</p>

<p>
Quicksort with random pivots takes O(n log n) expected running time, but its
worst-case running time is in Theta(n^2).  This means that there is a small
possibility that quicksort will cost Omega(n^2) dollars, but the probability
of that happening approaches zero as n approaches infinity.
</p>

<p>
A splay tree operation takes O(log n) amortized time, but the worst-case
running time for a splay tree operation is in Theta(n).  Splay trees are not
randomized, and the "probability" of an Omega(n)-time splay tree operation is
not a meaningful concept.  If you take an empty splay tree, insert the items
1&#x2026;n in order, then run find(1), the find operation <span class="underline">will</span> cost n dollars.
But a sequence of n splay tree operations, starting from an empty tree, <span class="underline">never</span>
costs more than O(n log n) actual running time.  Ever.
</p>

<p>
Hash tables are an interesting case, because they use both amortization and
randomization.  Resizing takes Theta(n) time.  With a random hash code, there
is a tiny probability that every item will hash to the same bucket, so the
worst-case running time of an operation is Theta(n)&#x2013;even without resizing.
</p>

<p>
To account for resizing, we use amortized analysis.  To account for collisions,
we use randomized analysis.  So when we say that hash table operations run in
O(1) time, we mean they run in O(1) <span class="underline">expected</span>, <span class="underline">amortized</span> time.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Splay trees</td>
<td class="org-left">O(log n) amortized time / operation</td>
<td class="org-left">\({*    }\)</td>
</tr>

<tr>
<td class="org-left">Disjoint sets (tree-based)</td>
<td class="org-left">O(alpha(f + u, u)) amortized time / find op</td>
<td class="org-left">\({**   }\)</td>
</tr>

<tr>
<td class="org-left">Quicksort</td>
<td class="org-left">O(n log n) expected time</td>
<td class="org-left">\({***  }\)</td>
</tr>

<tr>
<td class="org-left">Quickselect</td>
<td class="org-left">Theta(n) expected time</td>
<td class="org-left">\({**** }\)</td>
</tr>

<tr>
<td class="org-left">Hash tables</td>
<td class="org-left">Theta(1) expected amortized time / op</td>
<td class="org-left">\({*****}\)</td>
</tr>
</tbody>
</table>

<p>
If you take CS 170, you will learn an amortized analysis of disjoint sets
there.  Unfortunately, the analyses of both disjoint sets and splay trees are
complicated.  Goodrich &amp; Tamassia give the amortized analysis of splay trees,
but you're not required to read or understand it for this class.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">\(*\)</th>
<th scope="col" class="org-left">Worst-case time is in Theta(n), worst-case amortized time is in</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Theta(log n), best-case time is in Theta(1).</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(**\)</td>
<td class="org-left">For find operations, worst-case time is in Theta(log u), worst-case</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">amortized time is in Theta(alpha(f + u, u)), best-case time is in</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Theta(1).  All union operations take Theta(1) time.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">\(***\)</td>
<td class="org-left">Worst-case time is in Theta(n^2)&#x2013;if we get worst-case input AND</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">worst-case random numbers.  "Worst-case expected" time is in</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Theta(n log n)&#x2013;meaning when the <span class="underline">input</span> is worst-case, but we take the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">average over all possible sequences of random numbers.  Recall that</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">quicksort can be implemented so that keys equal to the pivot go into a</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">separate list, in which case the best-case time is in Theta(n), because</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the best-case input is one where all the keys are equal.  If quicksort</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">is implemented so that keys equal to the pivot are divided between lists</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">I1 and I2, as is the norm for array-based quicksort, then the best-case</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">time is in Theta(n log n).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">\(****\)</td>
<td class="org-left">Worst-case time is in Theta(n^2)&#x2013;if we get worst-case input AND worst-</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">case random numbers.  Worst-case expected time, best-case time, and</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">best-case expected time are in Theta(n).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">\(*****\)</td>
<td class="org-left">Worst-case time is in Theta(n), expected worst-case time is in Theta(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(worst case is when table is resized), amortized worst-case time is in</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Theta(n) (worst case is when every item is in one bucket), worst-case</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">expected amortized time is in Theta(1), best-case time is in Theta(1).</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Confused yet?</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
